# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas
import numpy as np
import pandas as pd

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

In [2]:
# Run this code:
salaries = pd.read_csv('../Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [3]:
# Your code here:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [4]:
new_cols = [i.lower().replace(' ', '_') for i in salaries.columns]

In [5]:
new_cols

['name',
 'job_titles',
 'department',
 'full_or_part-time',
 'salary_or_hourly',
 'typical_hours',
 'annual_salary',
 'hourly_rate']

In [6]:
salaries.columns = new_cols

In [7]:
# Your code here:
salaries.isna().sum()

name                     0
job_titles               0
department               0
full_or_part-time        0
salary_or_hourly         0
typical_hours        25161
annual_salary         8022
hourly_rate          25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [8]:
# Your code here:

salaries.salary_or_hourly.value_counts()

Salary    25161
Hourly     8022
Name: salary_or_hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [9]:
# Your code here:
salaries.department.value_counts()

POLICE                   13414
FIRE                      4641
STREETS & SAN             2198
OEMC                      2102
WATER MGMNT               1879
AVIATION                  1629
TRANSPORTN                1140
PUBLIC LIBRARY            1015
GENERAL SERVICES           980
FAMILY & SUPPORT           615
FINANCE                    560
HEALTH                     488
CITY COUNCIL               411
LAW                        407
BUILDINGS                  269
COMMUNITY DEVELOPMENT      207
BUSINESS AFFAIRS           171
COPA                       116
BOARD OF ELECTION          107
DoIT                        99
PROCUREMENT                 92
INSPECTOR GEN               87
MAYOR'S OFFICE              85
CITY CLERK                  84
ANIMAL CONTRL               81
HUMAN RESOURCES             79
CULTURAL AFFAIRS            65
BUDGET & MGMT               46
ADMIN HEARNG                39
DISABILITIES                28
TREASURER                   22
HUMAN RELATIONS             16
BOARD OF ETHICS              8
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: department, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [63]:
# Your code here:
from scipy.stats import ttest_1samp
from scipy.stats import stats
from scipy import stats
from statsmodels.stats.proportion import proportions_ztest

In [11]:
salaries.sample(4)

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
5351,"COLE, UNDRA",AVIATION SECURITY OFFICER,AVIATION,F,Salary,NaN,81156.0,NaN
4238,"CARROLL, MICHAEL A",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN
4790,"CHEUNG, GRACE W",ASST ADMINISTRATIVE SECRETARY III,MAYOR'S OFFICE,F,Salary,NaN,70380.0,NaN
19478,"MESSINO, WILLIAM N",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN

In [12]:
# Your code here:
salaried_empl = salaries[salaries['salary_or_hourly']=='Salary']['hourly_rate'].isnull().value_counts()

In [13]:
hourly_empl = salaries[salaries['salary_or_hourly']=='Hourly']['hourly_rate'].isnull().value_counts()

In [14]:
salaries.hourly_rate.value_counts()

35.60    1415
40.20     781
36.21     626
19.86     418
46.10     306
         ...
42.25       1
32.59       1
49.52       1
28.00       1
35.43       1
Name: hourly_rate, Length: 167, dtype: int64

In [15]:
total = int(salaried_empl) + int(hourly_empl)

In [16]:
salaries.shape[0] == total

True

In [64]:
salaries_hourly = salaries.hourly_rate.dropna()
# Eliminate all 'Nan' values, that as shown before belongs from all the salaried employees.

In [65]:
salaries_hourly.isna().value_counts()

False    8022
Name: hourly_rate, dtype: int64

In [66]:
salaries_hourly.mean()

32.78855771628128

In [67]:
# Your code here:
test_t=ttest_1samp(salaries_hourly, 30)
f'Conclussion: The P-value = {test_t.pvalue} > 0.005, is significantlly over the threshold, so we can conclude that the hourly wage of all hourly workers is significantly different from $30/hr.'

'Conclussion: The P-value = 4.3230240486229894e-92 > 0.005, is significantlly over the threshold, so we can conclude that the hourly wage of all hourly workers is significantly different from $30/hr.'

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [21]:
# Your code here:
police = salaries[salaries.department == 'POLICE']
police.head()

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
11,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
12,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN

In [45]:
salary_police = police[police.salary_or_hourly == 'Salary']
salary.sample(3)

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
16665,"LESLIE, ROSS E",SERGEANT,POLICE,F,Salary,NaN,104628.0,NaN
15952,"KUC, MARIA",POLICE OFFICER,POLICE,F,Salary,NaN,68616.0,NaN
19224,"MEADOR, WILLIAM A",SERGEANT,POLICE,F,Salary,NaN,107988.0,NaN

In [46]:
annual_salary_p = salary_police.annual_salary
sample.sample(3)

3808     28.48
28248    36.21
1235     28.48
Name: hourly_rate, dtype: float64

In [50]:
annual_salary_p.shape

(13404,)

In [52]:
annual_salary_p.isna().value_counts()

False    13404
Name: annual_salary, dtype: int64

In [71]:
t_test_2 = ttest_1samp(annual_salary_p,86000, alternative='greater')
f"Conclussion: They are independent, {t_test_2.pvalue} < 0.005 the value is less than the threshold, there fore we conclude that  salaries this year are higher than last year's"

"Conclussion: They are independent, 0.0010301701775482577 < 0.005 the value is less than the threshold, there fore we conclude that  salaries this year are higher than last year's"

Using the `crosstab` function, find the department that has the most hourly workers.

In [72]:
pd.crosstab(salaries.department, salaries['salary_or_hourly'])['Hourly']

department
ADMIN HEARNG                0
ANIMAL CONTRL              19
AVIATION                 1082
BOARD OF ELECTION           0
BOARD OF ETHICS             0
BUDGET & MGMT               2
BUILDINGS                   0
BUSINESS AFFAIRS            7
CITY CLERK                  0
CITY COUNCIL               64
COMMUNITY DEVELOPMENT       4
COPA                        0
CULTURAL AFFAIRS            7
DISABILITIES                0
DoIT                        0
FAMILY & SUPPORT          287
FINANCE                    44
FIRE                        2
GENERAL SERVICES          765
HEALTH                      3
HUMAN RELATIONS             0
HUMAN RESOURCES             4
INSPECTOR GEN               0
LAW                        40
LICENSE APPL COMM           0
MAYOR'S OFFICE              8
OEMC                     1273
POLICE                     10
POLICE BOARD                0
PROCUREMENT                 2
PUBLIC LIBRARY            299
STREETS & SAN            1862
TRANSPORTN                725
TREASURER                   0
WATER MGMNT              1513
Name: Hourly, dtype: int64

In [27]:
f'The department that has the most hourly workers is STREETS & SAN with 1862 '

'The department that has the most hourly workers is STREETS & SAN with 1862 '

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [28]:
sample = salaries[salaries.department == 'STREETS & SAN']['hourly_rate']

In [29]:
t_test_3 = stats.ttest_1samp(sample.dropna(),35,alternative='less')
f' The P-value is significantlly higher taht the threshold {t_test_3.pvalue} >0.005 '

' The P-value is significantlly higher taht the threshold 1.6689265282353859e-21 >0.005 '

# Challenge 3 - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [34]:
# Your code here:
confidence_levl = 0.95
test_hourly[:5]

4     19.86
6     46.10
7     35.60
10     2.65
18    17.68
Name: hourly_rate, dtype: float64

In [36]:
avg = test_hourly.mean()
avg

32.78855771628128

In [43]:
stats.t.interval(confidence_levl , df=len(test_hourly)-1, loc = avg, scale = stats.sem(test_hourly))

(32.52345834488529, 33.05365708767727)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [59]:
# Your code here:
annual_salary_p.sample(3)
stats.t.interval(alpha=0.95,df=len(annual_salary_p)-1,loc=np.mean(annual_salary_p),scale=stats.sem(annual_salary_p))

(86177.05631531784, 86795.77269094894)

# Challenge 4 - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [83]:
# Your code here:
sample_asp = salaries_hourly.count()
sample_asp

8022

In [82]:
sample_all_salaries = salaries.salary_or_hourly.count()
sample_all_salaries

33183

In [81]:
r = proportions_ztest(sample_asp,sample_all_salaries,0.25)
r

(-3.5099964213703005, 0.0004481127249057967)